In [31]:
import numpy as np
import pandas as pd

In [32]:
df=pd.read_csv("enhanced_messy_students.csv")

In [33]:
df.replace(["absent","missing",""],np.nan,inplace=True)

In [34]:
for col in ["Maths","Science","English"]:
    df[col]=pd.to_numeric(df[col],errors="coerce")

In [35]:
df.fillna(df.mean(numeric_only=True),inplace=True)

In [36]:
df.drop_duplicates(subset="Name",keep="first",inplace=True)

In [37]:
df.dropna(subset="Name",inplace=True)

In [38]:
print("\nCleand Data")
df

Cleand Data

      Name      Maths    Science    English Class
0   Ishika  89.000000  92.000000  85.000000   10A
1     Riya  78.000000  81.000000  74.000000   10A
2    Rahul  94.000000  90.000000  88.000000   10A
3     Aman  65.000000  70.000000  60.000000   10A
4    Ankit  55.000000  58.000000  62.000000   10B
5     Neha  82.000000  79.000000  88.000000   10B
6   Simran  91.000000  85.000000  90.000000   10B
7     Ravi  73.000000  75.000000  76.538462   10A
8    Priya  88.000000  78.642857  77.000000   10B
9    Sohan  79.615385  69.000000  71.000000   10A
10    Tina  67.000000  74.000000  76.538462   10B
13   Divya  79.615385  88.000000  84.000000   10B
14   Mohit  95.000000  91.000000  76.538462   10B